veroxzik/arduino-konami-spoof/arduino-konami/avr/boards.txt
#############################################################

leonardoiidx.name=IIDX Premium (Leonardo)

leonardoiidx.vid.0=0x1ccf
leonardoiidx.pid.0=0x8048

leonardoiidx.upload.tool=avrdude
leonardoiidx.upload.protocol=avr109
leonardoiidx.upload.maximum_size=28672
leonardoiidx.upload.maximum_data_size=2560
leonardoiidx.upload.speed=57600
leonardoiidx.upload.disable_flushing=true
leonardoiidx.upload.use_1200bps_touch=true
leonardoiidx.upload.wait_for_upload_port=true

leonardoiidx.bootloader.tool=avrdude
leonardoiidx.bootloader.low_fuses=0xff
leonardoiidx.bootloader.high_fuses=0xd8
leonardoiidx.bootloader.extended_fuses=0xcb
leonardoiidx.bootloader.file=caterina/Caterina-Leonardo.hex
leonardoiidx.bootloader.unlock_bits=0x3F
leonardoiidx.bootloader.lock_bits=0x2F

leonardoiidx.build.mcu=atmega32u4
leonardoiidx.build.f_cpu=16000000L
leonardoiidx.build.vid=0x1ccf
leonardoiidx.build.pid=0x8048
leonardoiidx.build.usb_product="beatmania IIDX controller premium model"
leonardoiidx.build.board=AVR_LEONARDO
leonardoiidx.build.core=arduino
leonardoiidx.build.variant=leonardo
leonardoiidx.build.extra_flags={build.usb_flags}
leonardoiidx.build.usb_manufacturer="Konami Amusement"

##############################################################

microiidx.name=IIDX Premium (Pro Micro)

microiidx.vid.0=0x1ccf
microiidx.pid.0=0x8048

microiidx.upload.tool=avrdude
microiidx.upload.protocol=avr109
microiidx.upload.maximum_size=28672
microiidx.upload.maximum_data_size=2560
microiidx.upload.speed=57600
microiidx.upload.disable_flushing=true
microiidx.upload.use_1200bps_touch=true
microiidx.upload.wait_for_upload_port=true

microiidx.bootloader.tool=avrdude
microiidx.bootloader.low_fuses=0xff
microiidx.bootloader.high_fuses=0xd8
microiidx.bootloader.extended_fuses=0xcb
microiidx.bootloader.file=caterina/Caterina-Micro.hex
microiidx.bootloader.unlock_bits=0x3F
microiidx.bootloader.lock_bits=0x2F

microiidx.build.mcu=atmega32u4
microiidx.build.f_cpu=16000000L
microiidx.build.vid=0x1ccf
microiidx.build.pid=0x8048
microiidx.build.usb_product="beatmania IIDX controller premium model"
microiidx.build.board=AVR_MICRO
microiidx.build.core=arduino
microiidx.build.variant=micro
microiidx.build.extra_flags={build.usb_flags}
microiidx.build.usb_manufacturer="Konami Amusement"

#############################################################

leonardosdvx.name=SDVX NEMSYS (Leonardo)

leonardosdvx.vid.0=0x1ccf
leonardosdvx.pid.0=0x101c

leonardosdvx.upload.tool=avrdude
leonardosdvx.upload.protocol=avr109
leonardosdvx.upload.maximum_size=28672
leonardosdvx.upload.maximum_data_size=2560
leonardosdvx.upload.speed=57600
leonardosdvx.upload.disable_flushing=true
leonardosdvx.upload.use_1200bps_touch=true
leonardosdvx.upload.wait_for_upload_port=true

leonardosdvx.bootloader.tool=avrdude
leonardosdvx.bootloader.low_fuses=0xff
leonardosdvx.bootloader.high_fuses=0xd8
leonardosdvx.bootloader.extended_fuses=0xcb
leonardosdvx.bootloader.file=caterina/Caterina-Leonardo.hex
leonardosdvx.bootloader.unlock_bits=0x3F
leonardosdvx.bootloader.lock_bits=0x2F

leonardosdvx.build.mcu=atmega32u4
leonardosdvx.build.f_cpu=16000000L
leonardosdvx.build.vid=0x1ccf
leonardosdvx.build.pid=0x101c
leonardosdvx.build.usb_product="SOUND VOLTEX controller"
leonardosdvx.build.board=AVR_LEONARDO
leonardosdvx.build.core=arduino
leonardosdvx.build.variant=leonardo
leonardosdvx.build.extra_flags={build.usb_flags}
leonardosdvx.build.usb_manufacturer="Konami Amusement"

##############################################################

microsdvx.name=SDVX NEMSYS (Pro Micro)

microsdvx.vid.0=0x1ccf
microsdvx.pid.0=0x101c

microsdvx.upload.tool=avrdude
microsdvx.upload.protocol=avr109
microsdvx.upload.maximum_size=28672
microsdvx.upload.maximum_data_size=2560
microsdvx.upload.speed=57600
microsdvx.upload.disable_flushing=true
microsdvx.upload.use_1200bps_touch=true
microsdvx.upload.wait_for_upload_port=true

microsdvx.bootloader.tool=avrdude
microsdvx.bootloader.low_fuses=0xff
microsdvx.bootloader.high_fuses=0xd8
microsdvx.bootloader.extended_fuses=0xcb
microsdvx.bootloader.file=caterina/Caterina-Micro.hex
microsdvx.bootloader.unlock_bits=0x3F
microsdvx.bootloader.lock_bits=0x2F

microsdvx.build.mcu=atmega32u4
microsdvx.build.f_cpu=16000000L
microsdvx.build.vid=0x1ccf
microsdvx.build.pid=0x101c
microsdvx.build.usb_product="SOUND VOLTEX controller"
microsdvx.build.board=AVR_MICRO
microsdvx.build.core=arduino
microsdvx.build.variant=micro
microsdvx.build.extra_flags={build.usb_flags}
microsdvx.build.usb_manufacturer="Konami Amusement"